//Камень-ножницы-бумага
//Напишите консольное приложение, которое играет с пользователем в камень-ножницы-бумагу.
//        Требования:
//Пользователь вводит значение через консоль
//К - камень
//Н - ножницы
//Б - бумага
//Программа выбирает свой вариант случайным образом
//Игра состоит из 5 раундов
//Баллы считаются по формуле ниже.
//По итогу 5 раундов, программа пишет счет и объявляет победителя. Конец игры.
//Как считать баллы:
//Если сторона одержала победу с помощью камня (К), победитель получает 1 балл
//Если сторона одержала победу с помощью ножниц (Н), победитель получает 2 балла
//Если сторона одержала победу с помощью бумаги (Б), победитель получает 5 баллов

public class Task4 {
    public static void main(String[] args) {

    }
}
